# Версия бота 3.0.5 Разработчик @ArthurKorytko. Последние обновление: Добавлен вывод расписание в диапазоне дат ++ Добавлео рассписание сессий + Подключена БД. upd 3.0.4 Заменена БД на бесплатную.  upd 3.0.5 Добавлена кнопка "Группы" + Обновлена кнопка "Сессия"
from supabase import create_client
from telegram import Update, ReplyKeyboardMarkup
from telegram.ext import Application, CommandHandler, MessageHandler, filters, CallbackContext
from datetime import datetime, timedelta

TOKEN = ''
SUPABASE_URL = ''
SUPABASE_API_KEY = ''


supabase = create_client(SUPABASE_URL, SUPABASE_API_KEY)


def create_table():
    try:
        response = supabase.table("users").upsert({
            "user_id": 0,
            "username": "test",
            "last_active": datetime.now().isoformat()
        }).execute()
        print(response)
    except Exception as e:
        print(f"Ошибка (запрос к бд) Supabase: {e}")


create_table()

button_texts = {
    'Оксененко С.А': 'ZOOM: \n Логин: 9184322138 \n Пароль: 2sKy8e',
    'Оксененко': 'ZOOM: \n Логин: 9184322138 \n Пароль: 2sKy8e',
    'Панова О.С': 'ZOOM: \n Логин: 938 958 8159 \n Пароль: 401',
    'Панова': 'ZOOM: \n Логин: 938 958 8159 \n Пароль: 401',
    'Мілютіна О. С': 'ZOOM: \n Логин: 978 357 9002 \n Пароль: 211047',
    'Милютина': 'ZOOM: \n Логин: 978 357 9002 \n Пароль: 211047',
    'Семенченко Т.О': 'ZOOM: \n Логин: 764 968 7132 \n Пароль: 507',
    'Семенченко': 'ZOOM: \n Логин: 764 968 7132 \n Пароль: 507',
    'Іванова І.В': 'ZOOM: \n Логин: 986 034 2218 \n Пароль: 311',
    'Иванова': 'ZOOM: \n Логин: 986 034 2218 \n Пароль: 311',
    'Каплун Є.О': 'ZOOM: \n Логин: 5068639210 \n Пароль: 1723',
    'Каплун': 'ZOOM: \n Логин: 5068639210 \n Пароль: 1723',
    'Бєлікова В.В': 'ZOOM: \n Логин: 5742475269 \n Пароль: 235067',
    'Беликова В': 'ZOOM: \n Логин: 5742475269 \n Пароль: 235067',
    'Ігнатьєв Д.С': 'Google Meet: \n https://meet.google.com/rdo-wrez-vci',
    'Игнатьев': 'Google Meet: \n https://meet.google.com/rdo-wrez-vci',
    'Бєлікова С.О': 'ZOOM: \n Логин: 484 982 3188 \n Пароль: 12345',
    'Беликова С': 'ZOOM: \n Логин: 484 982 3188 \n Пароль: 12345',
    'Повгородній В.О': 'Google Meet: \n https://meet.google.com/kqx-torr-cec',
    'Повгородний': 'Google Meet: \n https://meet.google.com/kqx-torr-cec',
    'Онопченко А.В': 'Google Meet: \n https://meet.google.com/fmg-avfj-byp?authuser=2',
    'Онопченко': 'Google Meet: \n https://meet.google.com/fmg-avfj-byp?authuser=2',
    'Кто что ведет?': ' ТО ЕТ ЕЛ Лк - Бєлікова С.О. \n ОПрогр - Ігнатьєв Д.С. \n ІсторіяУ - Панова О.С. \n ВМатем - Мілютіна О. С \n Фізика ЛК - Семенченко Т.О. \n Фізика ПЗ - Повгородній В.О. \n Фізика Лб - Онопченко А.В \n ФізВихов - Каплун Є.О \n IT ЛК - Бєлікова В.В. \n ІТ ЛБ - Іванова І.В. \n ЕконТ-рія - Оксененко С.А ',
    'кто что ведет?': ' ТО ЕТ ЕЛ Лк - Бєлікова С.О. \n ОПрогр - Ігнатьєв Д.С. \n ІсторіяУ - Панова О.С. \n ВМатем - Мілютіна О. С \n Фізика ЛК - Семенченко Т.О. \n Фізика ПЗ - Повгородній В.О. \n Фізика Лб - Онопченко А.В \n ФізВихов - Каплун Є.О \n IT ЛК - Бєлікова В.В. \n ІТ ЛБ - Іванова І.В. \n ЕконТ-рія - Оксененко С.А ',
    'Время пар': ' 1 пара: 8:30 - 9:50 \n 2 пара: 10:00 - 11:20 \n 3 пара: 11:40 - 13:00 \n 4 пара: 13:10 - 14:30 \n 5 пара: 14:40 - 16:00 \n 6 пара: 16:10 - 17:30 \n 7 пара: 17:40 - 19:00',
    'время пар': ' 1 пара: 8:30 - 9:50 \n 2 пара: 10:00 - 11:20 \n 3 пара: 11:40 - 13:00 \n 4 пара: 13:10 - 14:30 \n 5 пара: 14:40 - 16:00 \n 6 пара: 16:10 - 17:30 \n 7 пара: 17:40 - 19:00',
    'Помощь': 'Чтобы узнать расписание пар на конкретный день, введите дату в формате "день.месяц.24" \nЧто бы узнать расписание времени пар введите "Время пар" \nЕсли вы забыли имя и отчество преподaвателя введите "Преподаватели" \nВы можете ввести фамилию преподавателя что бы вывелась его ссылка',
    'помощь': 'Чтобы узнать расписание пар на конкретный день, введите дату в формате "день.месяц.24" \nЧто бы узнать расписание времени пар введите "Время пар" \nЕсли вы забыли имя и отчество преподaвателя введите "Преподаватели" \nВы можете ввести фамилию преподавателя что бы вывелась его ссылка',
    'Преподаватели': 'Оксененко Світлана Петрівна \nПанова Олена Сергіївна \nМілютіна Ольга Святославівна \nСеменченко Тетяна Олександрівна \nІванова Ірина Валеріївна \nКаплун Євген Олександрович \nБєлікова Вікторія Вікторівна \nІгнатьєв Дмитро Сергійович \nБєлікова Станіслава Олегівна \nПовгородній Володимир Олегович \nОнопченко Анатолій Віталійович',
    'преподаватели': 'Оксененко Світлана Петрівна \nПанова Олена Сергіївна \nМілютіна Ольга Святославівна \nСеменченко Тетяна Олександрівна \nІванова Ірина Валеріївна \nКаплун Євген Олександрович \nБєлікова Вікторія Вікторівна \nІгнатьєв Дмитро Сергійович \nБєлікова Станіслава Олегівна \nПовгородній Володимир Олегович \nОнопченко Анатолій Віталійович',
    'Дополнительная информация': 'Мой создатель: @ArthurKorytko \nЕсли какие-то ошибки, или дополнения, пиши ему.',
    'Сесія': '1 група\n\n ❗️Підготовка❗️\n 6 пара, 16.12.24 (ПН) - "Інформаційні технології" конс. до іспиту, Бєлікова В.В\n\n 5 пара, 18.12.24 (СР) - "Історія України" конс. до іспиту, Панова О.С.\n\n ❗️  ІСПИТ ❗️\n 9:00 21.12.24 (СБ) - "Інформаційні технології" іспит, Бєлікова В.В\n\n 9:00 28.12.24 (СБ) - "Історія України" іспит, Панова О.С\n\n\n2 група\n\n ❗️Підготовка❗️\n 6 пара, 16.12.24 (ПН) - "Інформаційні технології" конс. до іспиту, Бєлікова В.В\n\n 5 пара, 18.12.24 (СР) - "Історія України" конс. до іспиту, Панова О.С.\n\n ❗️  ІСПИТ ❗️\n 9:00 23.12.24 (ПН) - "Інформаційні технології" іспит, Бєлікова В.В\n\n 9:00 27.12.24 (ПТ) - "Історія України" іспит, Панова О.С\n\n Что бы узнать свою группу напиши "Группы"',
    'сесія': '1 група\n\n ❗️Підготовка❗️\n 6 пара, 16.12.24 (ПН) - "Інформаційні технології" конс. до іспиту, Бєлікова В.В\n\n 5 пара, 18.12.24 (СР) - "Історія України" конс. до іспиту, Панова О.С.\n\n ❗️  ІСПИТ ❗️\n 9:00 21.12.24 (СБ) - "Інформаційні технології" іспит, Бєлікова В.В\n\n 9:00 28.12.24 (СБ) - "Історія України" іспит, Панова О.С\n\n\n2 група\n\n ❗️Підготовка❗️\n 6 пара, 16.12.24 (ПН) - "Інформаційні технології" конс. до іспиту, Бєлікова В.В\n\n 5 пара, 18.12.24 (СР) - "Історія України" конс. до іспиту, Панова О.С.\n\n ❗️  ІСПИТ ❗️\n 9:00 23.12.24 (ПН) - "Інформаційні технології" іспит, Бєлікова В.В\n\n 9:00 27.12.24 (ПТ) - "Історія України" іспит, Панова О.С\n\n Что бы узнать свою группу напиши "Группы"',
    'Сессия': '1 група\n\n ❗️Підготовка❗️\n 6 пара, 16.12.24 (ПН) - "Інформаційні технології" конс. до іспиту, Бєлікова В.В\n\n 5 пара, 18.12.24 (СР) - "Історія України" конс. до іспиту, Панова О.С.\n\n ❗️  ІСПИТ ❗️\n 9:00 21.12.24 (СБ) - "Інформаційні технології" іспит, Бєлікова В.В\n\n 9:00 28.12.24 (СБ) - "Історія України" іспит, Панова О.С\n\n\n2 група\n\n ❗️Підготовка❗️\n 6 пара, 16.12.24 (ПН) - "Інформаційні технології" конс. до іспиту, Бєлікова В.В\n\n 5 пара, 18.12.24 (СР) - "Історія України" конс. до іспиту, Панова О.С.\n\n ❗️  ІСПИТ ❗️\n 9:00 23.12.24 (ПН) - "Інформаційні технології" іспит, Бєлікова В.В\n\n 9:00 27.12.24 (ПТ) - "Історія України" іспит, Панова О.С\n\n Что бы узнать свою группу напиши "Группы"',
    'сессия': '1 група\n\n ❗️Підготовка❗️\n 6 пара, 16.12.24 (ПН) - "Інформаційні технології" конс. до іспиту, Бєлікова В.В\n\n 5 пара, 18.12.24 (СР) - "Історія України" конс. до іспиту, Панова О.С.\n\n ❗️  ІСПИТ ❗️\n 9:00 21.12.24 (СБ) - "Інформаційні технології" іспит, Бєлікова В.В\n\n 9:00 28.12.24 (СБ) - "Історія України" іспит, Панова О.С\n\n\n2 група\n\n ❗️Підготовка❗️\n 6 пара, 16.12.24 (ПН) - "Інформаційні технології" конс. до іспиту, Бєлікова В.В\n\n 5 пара, 18.12.24 (СР) - "Історія України" конс. до іспиту, Панова О.С.\n\n ❗️  ІСПИТ ❗️\n 9:00 23.12.24 (ПН) - "Інформаційні технології" іспит, Бєлікова В.В\n\n 9:00 27.12.24 (ПТ) - "Історія України" іспит, Панова О.С\n\n Что бы узнать свою группу напиши "Группы"',
    'групи': '1 група:\n\n1. Бездрабко С.В\n2. Васильєв С.В.\n3. Довгопол О.О\n4. Кондратюк О.Ю\n5. Мельник В.О\n6. Мікуленко Α.Ο\n7. Лукінов В.С\n8. Назаренко Л.А\n9. Осадчий М.В\n10. Ращупкін М.В\n11. Резніченко Б.А.\n12. Сергійчук Ю.Є\n13. Сілін Ю.Α\n14. Тарасенко О.В\n15. Тарянік Д.В.\n16. Тіщенко С.О\n17. Тарнавський С.Б.\n18. Швецов О.Ю\n\n\n 2 група:\n\n1. Андрющенко Р.Є\n2. Анісімов Р.В\n3. Богатиренко А.О\n4. Волошин Д.Є\n5. Галій М.М.\n6. Голоднюк А.В\n7. Давидов С.Д\n8. Дідюк Є.М\n9. Зюзько В.B\n10. Коритко А.Л\n11. Коробка О.С\n12. Марченко Д.І.\n13. Мустафаєв Р.А.\n14. Нестеренко М.О\n15. Працюк О.Я.\n16. Руденко Д.О\n17. Сіладі О.В\n18. Супрун К.С\n19. Тарабан Д.В\n20. Харченко М.А',
    'Групи': '1 група:\n\n1. Бездрабко С.В\n2. Васильєв С.В.\n3. Довгопол О.О\n4. Кондратюк О.Ю\n5. Мельник В.О\n6. Мікуленко Α.Ο\n7. Лукінов В.С\n8. Назаренко Л.А\n9. Осадчий М.В\n10. Ращупкін М.В\n11. Резніченко Б.А.\n12. Сергійчук Ю.Є\n13. Сілін Ю.Α\n14. Тарасенко О.В\n15. Тарянік Д.В.\n16. Тіщенко С.О\n17. Тарнавський С.Б.\n18. Швецов О.Ю\n\n\n 2 група:\n\n1. Андрющенко Р.Є\n2. Анісімов Р.В\n3. Богатиренко А.О\n4. Волошин Д.Є\n5. Галій М.М.\n6. Голоднюк А.В\n7. Давидов С.Д\n8. Дідюк Є.М\n9. Зюзько В.B\n10. Коритко А.Л\n11. Коробка О.С\n12. Марченко Д.І.\n13. Мустафаєв Р.А.\n14. Нестеренко М.О\n15. Працюк О.Я.\n16. Руденко Д.О\n17. Сіладі О.В\n18. Супрун К.С\n19. Тарабан Д.В\n20. Харченко М.А',
    'Группы': '1 група:\n\n1. Бездрабко С.В\n2. Васильєв С.В.\n3. Довгопол О.О\n4. Кондратюк О.Ю\n5. Мельник В.О\n6. Мікуленко Α.Ο\n7. Лукінов В.С\n8. Назаренко Л.А\n9. Осадчий М.В\n10. Ращупкін М.В\n11. Резніченко Б.А.\n12. Сергійчук Ю.Є\n13. Сілін Ю.Α\n14. Тарасенко О.В\n15. Тарянік Д.В.\n16. Тіщенко С.О\n17. Тарнавський С.Б.\n18. Швецов О.Ю\n\n\n 2 група:\n\n1. Андрющенко Р.Є\n2. Анісімов Р.В\n3. Богатиренко А.О\n4. Волошин Д.Є\n5. Галій М.М.\n6. Голоднюк А.В\n7. Давидов С.Д\n8. Дідюк Є.М\n9. Зюзько В.B\n10. Коритко А.Л\n11. Коробка О.С\n12. Марченко Д.І.\n13. Мустафаєв Р.А.\n14. Нестеренко М.О\n15. Працюк О.Я.\n16. Руденко Д.О\n17. Сіладі О.В\n18. Супрун К.С\n19. Тарабан Д.В\n20. Харченко М.А',
    'группы': '1 група:\n\n1. Бездрабко С.В\n2. Васильєв С.В.\n3. Довгопол О.О\n4. Кондратюк О.Ю\n5. Мельник В.О\n6. Мікуленко Α.Ο\n7. Лукінов В.С\n8. Назаренко Л.А\n9. Осадчий М.В\n10. Ращупкін М.В\n11. Резніченко Б.А.\n12. Сергійчук Ю.Є\n13. Сілін Ю.Α\n14. Тарасенко О.В\n15. Тарянік Д.В.\n16. Тіщенко С.О\n17. Тарнавський С.Б.\n18. Швецов О.Ю\n\n\n 2 група:\n\n1. Андрющенко Р.Є\n2. Анісімов Р.В\n3. Богатиренко А.О\n4. Волошин Д.Є\n5. Галій М.М.\n6. Голоднюк А.В\n7. Давидов С.Д\n8. Дідюк Є.М\n9. Зюзько В.B\n10. Коритко А.Л\n11. Коробка О.С\n12. Марченко Д.І.\n13. Мустафаєв Р.А.\n14. Нестеренко М.О\n15. Працюк О.Я.\n16. Руденко Д.О\n17. Сіладі О.В\n18. Супрун К.С\n19. Тарабан Д.В\n20. Харченко М.А',
    'Обновление 2.1': 'Обновление было 12.10.24 \nБыла добавлена кнопка "Помощь" \nБыло добавлено расписание пар по вызову даты DD.MM.24 \nБыла добалена возможность писать некоторые запросы для бота с маленькой буквы \nБыла добавлена команда "Преподаватели" \nМелкие изменения: \nБыл оптимизирован код для быстрой работы бота \nИсправлены мелкие ошибки в каллиграфии',
    'Обновление 2.2': 'Обновление было 10.11.24 \nОбновлено и изменено расписание \nВывод расписание в диапазоне дат DD.MM.24-DD.MM.24',
    'Обновление 3.0': 'Обновление было 20.11.24 \nДобавлено расписание сессий \nВывод расписания без указания года DD.MM \nДобавлено уведомления пользователю при обновлении бота',
}

schedule = {
    '07.10.24': '1- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О. \n 2- ОПрогр Лк, ауд.214, Ігнатьєв Д.С. \n 3- ІсторіяУ Лк, ауд.401, Панова О.С. \n 4- ВМатем. Лк, ауд.515, Мілютіна О.С.',
    '08.10.24': '2- Фізика Пз, ауд.513, Повгородній В.О. \n 3- Фізика Лк, ауд.507, Семенченко Т.О. \n 4- ФізВихов Пз, ауд.103, Каплун Є.О. \n 5- ІТ Лк, ауд.308, Бєлікова В.В.',
    '09.10.24': '2- ІТ Лб1, ауд.325, Іванова І.В. \n 3- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О. \n 4- ЕконТ-рія Лк, Оксененко С.П.',
    '10.10.24': '2- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О. \n 3- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О. \n 4- Фізика Лб1, ауд.324, Онопченко А.В. \n 5- ІТ Лб1, ауд.214, Іванова І.В.',
    '11.10.24': '1- ВМатем. Пз, ауд.515, Мілютіна О.С. \n 2- ВМатем. Лк, ауд.515, Мілютіна О.С. \n 3- Фізика Лб2, ауд.513, Онопченко А.В. \n 4- ЕконТ-рія Пз, ауд.504, Оксененко С.П. \n 5- ІТ Пз, ауд.308, Бєлікова В.В.',
    '14.10.24': '2- ВМатем. Пз, ауд.515, Мілютіна О.С. \n 3- ІсторіяУ Лк, ауд.401, Панова О.С. \n 4- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О. \n 5- Фізика Лк, ауд.507, Семенченко Т.О.',
    '15.10.24': '1- ІТ Пз, ауд.308, Бєлікова В.В. \n 2- ІТ Лк, ауд.308, Бєлікова В.В. \n 3- ВМатем. Пз, ауд.515, Мілютіна О.С. \n 4- ФізВихов Пз, ауд.103, Каплун Є.О.',
    '16.10.24': '2- ТО ЕТ ЕЛ Пз, ауд.413, Бєлікова С.О. \n 3- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О. \n 4- ЕконТ-рія Лк, Оксененко С.П.',
    '17.10.24': '4- Фізика Лб1, ауд.324, Онопченко А.В. \n 5- ІТ Лб1, ауд.214, Іванова І.В.',
    '18.10.24': '1- ОПрогр Лк, ауд.214, Ігнатьєв Д.С. \n 2- ОПрогр Лб1, ауд.214, Ігнатьєв Д.С. \n 3- Фізика Лб1, ауд.507, Онопченко А.В. \n 4- ЕконТ-рія Пз, ауд.504, Оксененко С.П.',
    '21.10.24': '1- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О. \n 2- ОПрогр Лк, ауд.214, Ігнатьєв Д.С. \n 3- ІсторіяУ Лк, ауд.401, Панова О.С. \n 4- ВМатем. Пз, ауд.515, Мілютіна О.С.',
    '22.10.24': '2- Фізика Пз, ауд.513, Повгородній В.О. \n 3- Фізика Лк, ауд.507, Семенченко Т.О. \n 4- ФізВихов Пз, ауд.103, Каплун Є.О. \n 5- ІТ Лк, ауд.308, Бєлікова В.В.',
    '23.10.24': '2- ІТ Лб1, ауд.325, Іванова І.В. \n 3- ТО ЕТ ЕЛ Лб2, ауд.413, Бєлікова С.О. \n 4- ЕконТ-рія Лк, Оксененко С.П.',
    '24.10.24': '2- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О. \n 3- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О. \n 4- Фізика Лб1, ауд.324, Онопченко А.В. \n 5- ІТ Лб1, ауд.214, Іванова І.В.',
    '25.10.24': '1- ВМатем. Пз, ауд.515, Мілютіна О.С. \n 2- ВМатем. Лк, ауд.515, Мілютіна О.С. \n 3- Фізика Лб2, ауд.513, Онопченко А.В. \n 4- ЕконТ-рія Пз, ауд.504, Оксененко С.П. \n 5- ІТ Пз, ауд.308, Бєлікова В.В.',
    '28.10.24': '2- ВМатем. Пз, ауд.515, Мілютіна О.С. \n 3- ІсторіяУ Лк, ауд.401, Панова О.С. \n 4- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О. \n 5- Фізика Лк, ауд.507, Семенченко Т.О.',
    '29.10.24': '1- ІТ Пз, ауд.308, Бєлікова В.В. \n 2- ІТ Лк, ауд.308, Бєлікова В.В. \n 3- ВМатем. Пз, ауд.515, Мілютіна О.С. \n 4- ФізВихов Пз, ауд.103, Каплун Є.О.',
    '30.10.24': '2- ТО ЕТ ЕЛ Пз, ауд.413, Бєлікова С.О. \n 3- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О. \n 4- ЕконТ-рія Лк, Оксененко С.П.',
    '31.10.24': '4- Фізика Лб1, ауд.324, Онопченко А.В. \n 5- ІТ Лб1, ауд.214, Іванова І.В.',
    '01.11.24': '1- ОПрогр Лк, ауд.214, Ігнатьєв Д.С. \n 2- ОПрогр Лб1, ауд.214, Ігнатьєв Д.С. \n 3- Фізика Лб1, ауд.507, Онопченко А.В. \n 4- ЕконТ-рія Пз, ауд.504, Оксененко С.П.',
    '04.11.24': '1- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О. \n 2- ОПрогр Лк, ауд.214, Ігнатьєв Д.С. \n 3- ІсторіяУ Лк, ауд.401, Панова О.С. \n 4- ВМатем. Пз, ауд.515, Мілютіна О.С.',
    '05.11.24': '2- Фізика Пз, ауд.513, Повгородній В.О. \n 3- Фізика Лк, ауд.507, Семенченко Т.О. \n 4- ФізВихов Пз, ауд.103, Каплун Є.О. \n 5- ІТ Лк, ауд.308, Бєлікова В.В.',
    "06.11.24": "2- ІТ Лб1, ауд.325, Іванова І.В. \n ТО ЕТ ЕЛ Лб2, ауд.413, Бєлікова С.О. \n 3- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О. \n ІТ Лб2, ауд.214, Іванова І.В. \n 4- ЕконТ-рія Лк, Оксененко С.П.",
    "07.11.24": "2- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О. \n 3- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О. \n 4- Фізика Лб1, ауд.324, Онопченко А.В. \n ТО ЕТ ЕЛ Лб2, ауд.413, Бєлікова С.О. \n 5- ІТ Лб1, ауд.214, Іванова І.В. \n Фізика Лб2, ауд.324, Онопченко А.В. \n 6- ІТ Лб2, ауд.214, Іванова І.В.",
    "08.11.24": "2- ВМатем. Лк, ауд.515, Мілютіна О.С. \n 3- Фізика Лб2, ауд.513, Онопченко А.В. \n 4- ЕконТ-рія Пз, ауд.504, Оксененко С.П. \n 5- ІТ Пз, ауд.308, Бєлікова В.В.",
    '11.11.24': '3- ІсторіяУ Лк, ауд.401, Панова О.С.\n4- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О.\n5- Фізика Лк, ауд.507, Семенченко Т.О.',
    '12.11.24': '1- ІТ Пз, ауд.308, Бєлікова В.В.\n2- ІТ Лк, ауд.308, Бєлікова В.В.\n3- ВМатем. Пз, ауд.515, Мілютіна О.С.\n4- ФізВихов Пз, ауд.103, Каплун Є.О.',
    '13.11.24': '2- ТО ЕТ ЕЛ Пз, ауд.413, Бєлікова С.О.\n3- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О.\n4- ЕконТ-рія Лк, Оксененко С.П.\n5- ВМатем. Пз, ауд.515, Мілютіна О.С.',
    '14.11.24': '4- ТО ЕТ ЕЛ Пз, ауд.413, Бєлікова С.О.\n5- ІТ Лб1, ауд.214, Іванова І.В.\n6- ІТ Лб2, ауд.214, Іванова І.В.',
    '15.11.24': '1- ОПрогр Лк, ауд.214, Ігнатьєв Д.С.\n2- ОПрогр Лб1, ауд.214, Ігнатьєв Д.С.\n3- Фізика Лб1, ауд.507, Онопченко А.В.\n4- ЕконТ-рія Пз, ауд.504, Оксененко С.П.',
    '18.11.24': '1- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О.\n2- ОПрогр Лк, ауд.214, Ігнатьєв Д.С.\n3- ІсторіяУ Лк, ауд.401, Панова О.С.\n4- ВМатем. Пз, ауд.515, Мілютіна О.С.',
    '19.11.24': '2- Фізика Пз, ауд.513, Повгородній В.О.\n3- Фізика Лк, ауд.507, Семенченко Т.О.\n4- ФізВихов Пз, ауд.103, Каплун Є.О.\n5- ІТ Лк, ауд.308, Бєлікова В.В.',
    '20.11.24': '2- ІТ Лб1, ауд.325, Іванова І.В.\n3- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О.\n4- ЕконТ-рія Лк, Оксененко С.П.',
    '21.11.24': '2- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О.\n3- ТО ЕТ ЕЛ Пз, ауд.413, Бєлікова С.О.\n4- Фізика Лб1, ауд.324, Онопченко А.В.\n5- ІТ Лб1, ауд.214, Іванова І.В.\n6- ІТ Лб2, ауд.214, Іванова І.В.',
    '22.11.24': '2- ВМатем. Лк, ауд.515, Мілютіна О.С.\n3- Фізика Лб2, ауд.513, Онопченко А.В.\n4- ЕконТ-рія Пз, ауд.504, Оксененко С.П.\n5- ІТ Пз, ауд.308, Бєлікова В.В.',
    '25.11.24': '3- ІсторіяУ Лк, ауд.401, Панова О.С.\n4- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О.\n5- Фізика Лк, ауд.507, Семенченко Т.О.',
    '26.11.24': '1- ІТ Пз, ауд.308, Бєлікова В.В.\n2- ІТ Лк, ауд.308, Бєлікова В.В.\n3- ВМатем. Пз, ауд.515, Мілютіна О.С.\n4- ФізВихов Пз, ауд.103, Каплун Є.О.',
    '27.11.24': '2- ТО ЕТ ЕЛ Пз, ауд.413, Бєлікова С.О.\n3- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О.\n4- ЕконТ-рія Лк, Оксененко С.П.\n5- ВМатем. Пз, ауд.515, Мілютіна О.С.',
    '28.11.24': '3- ІТ Лб1, ауд.214, Іванова І.В.\n4- ІТ Лб1, ауд.214, Іванова І.В.\n5- ІТ Лб2, ауд.214, Іванова І.В.\n6- ІТ Лб2, ауд.214, Іванова І.В.',
    '29.11.24': '1- ОПрогр Лк, ауд.214, Ігнатьєв Д.С.\n2- ОПрогр Лб1, ауд.214, Ігнатьєв Д.С.\n3- Фізика Лб1, ауд.507, Онопченко А.В.\n4- ЕконТ-рія Пз, ауд.504, Оксененко С.П.',
    '02.12.24': '1- ТО ЕТ ЕЛ Пз, ауд.413, Бєлікова С.О.\n2- ОПрогр Лк, ауд.214, Ігнатьєв Д.С.\n3- ІсторіяУ Лк, ауд.401, Панова О.С.\n4- ВМатем. Пз, ауд.515, Мілютіна О.С.',
    '03.12.24': '2- Фізика Пз, ауд.513, Повгородній В.О.\n3- Фізика Лк, ауд.507, Семенченко Т.О.\n4- ФізВихов Пз, ауд.103, Каплун Є.О.\n5- ІТ Лк, ауд.308, Бєлікова В.В.',
    '04.12.24': '2- ІТ Лб1, ауд.325, Іванова І.В.\n3- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О.\n4- ЕконТ-рія Лк, Оксененко С.П.',
    '05.12.24': '2- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О.\n3- ТО ЕТ ЕЛ Пз, ауд.413, Бєлікова С.О.\n4- Фізика Лб1, ауд.324, Онопченко А.В.\n5- ІТ Лб1, ауд.214, Іванова І.В.\n6- ІТ Лб2, ауд.214, Іванова І.В.',
    '06.12.24': '2- ВМатем. Лк, ауд.515, Мілютіна О.С.\n3- Фізика Лб2, ауд.513, Онопченко А.В.\n4- ЕконТ-рія Пз, ауд.504, Оксененко С.П.\n5- ІТ Пз, ауд.308, Бєлікова В.В.',
    '09.12.24': '1- ОПрогр Лк, ауд.321, Ігнатьєв Д.С.\n2- ОПрогр Лк, ауд.308, Ігнатьєв Д.С.\n3- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О.\n4- ВМатем. Пз, ауд.515, Мілютіна О.С.',
    '10.12.24': '1- ІТ Пз, ауд.308, Бєлікова В.В.\n2- ІТ Лк, ауд.308, Бєлікова В.В.\n3- ВМатем. Пз, ауд.515, Мілютіна О.С.\n4- ФізВихов Пз, ауд.103, Каплун Є.О.',
    '11.12.24': '2- ТО ЕТ ЕЛ Пз, ауд.413, Бєлікова С.О.\n3- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О.\n4- ЕконТ-рія Лк, Оксененко С.П.',
    '12.12.24': '3- Фізика Лк, ауд.507, Семенченко Т.О.\n4- Фізика Лб1, ауд.324, Онопченко А.В.\n5- ІТ Лб1, ауд.214, Іванова І.В.; Фізика Лб2, ауд.324, Онопченко А.В.\n6- ІТ Лб2, ауд.214, Іванова І.В.',
    '13.12.24': '1- ОПрогр Лк, ауд.214, Ігнатьєв Д.С.\n2- ОПрогр Лб1, ауд.214, Ігнатьєв Д.С.\n3- Фізика Лб1, ауд.507, Онопченко А.В.; ОПрогр Лб2, ауд.214, Ігнатьєв Д.С.\n4- ЕконТ-рія Пз, ауд.504, Оксененко С.П.',
    '16.12.24': '1- ОПрогр Лб1, ауд.306, Ігнатьєв Д.С.\n2- ОПрогр Лб2, ауд.306, Ігнатьєв Д.С.\n3- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О.\n4- ВМатем. Залік, ауд.515, Мілютіна О.С.\n5- ЕконТ-рія Залік, ауд.504, Оксененко С.П.',
    '17.12.24': '2- Фізика Пз, ауд.513, Повгородній В.О.\n3- Фізика Лк, ауд.507, Семенченко Т.О.\n4- ФізВихов Пз, ауд.103, Каплун Є.О.\n5- ІТ Лк, ауд.308, Бєлікова В.В.\n6- ФізВихов Залік, ауд.103, Каплун Є.О.',
    '18.12.24': '2- ТО ЕТ ЕЛ Лк, ауд.413, Бєлікова С.О.\n3- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О.; ІТ Лб2, ауд.214, Іванова І.В.\n4- ІТ Лб1, ауд.214, Іванова І.В.; ТО ЕТ ЕЛ Лб2, ауд.413, Бєлікова С.О.',
    '19.12.24': '3- ТО ЕТ ЕЛ Лб1, ауд.413, Бєлікова С.О.\n4- ТО ЕТ ЕЛ Лб2, ауд.413, Бєлікова С.О.\n5- ІТ Лб1, ауд.214, Іванова І.В.\n6- ІТ Лб2, ауд.214, Іванова І.В.\n7- ТО ЕТ ЕЛ Залік, ауд.413, Бєлікова С.О.',
    '20.12.24': '1- ОПрогр Лб1, ауд.306, Ігнатьєв Д.С.\n2- ОПрогр Лб2, ауд.306, Ігнатьєв Д.С.\n3- ОПрогр Залік, ауд.306, Ігнатьєв Д.С.\n4- Фізика Залік, ауд.507, Семенченко Т.О.'
}


def add_user(user_id, username):
    try:
        data = {
            "user_id": user_id,
            "username": username,
            "last_active": datetime.now().isoformat()
        }
        supabase.table("users").upsert(data).execute()
    except Exception as e:
        print(f"Ошибка добавления пользователя: {e}")


def get_users_from_db():
    try:
        response = supabase.table("users").select(
            "user_id, username, last_active").execute()
        users = response.data
        return users
    except Exception as e:
        print(f"Ошибка извлечения пользователя: {e}")
        return []


async def start(update: Update, context: CallbackContext) -> None:
    user_id = update.message.from_user.id
    username = update.message.from_user.username
    add_user(user_id, username)

    keyboard = [
        ['Оксененко С.А', 'Панова О.С', 'Мілютіна О. С'],
        ['Семенченко Т.О', 'Іванова І.В', 'Каплун Є.О'],
        ['Бєлікова В.В', 'Ігнатьєв Д.С', 'Бєлікова С.О'],
        ['Повгородній В.О', 'Онопченко А.В', 'Кто что ведет?'],
        ['Время пар', 'Помощь', 'Сессия', 'Группы'],
        ['Дополнительная информация']
    ]
    reply_markup = ReplyKeyboardMarkup(
        keyboard, one_time_keyboard=False, resize_keyboard=True
    )
    await update.message.reply_text('Выбери одну из кнопок для работы со мной. Или введи "Помощь"', reply_markup=reply_markup)


async def button_handler(update: Update, context: CallbackContext) -> None:
    user_choice = update.message.text
    current_year = datetime.now().year
    try:
        if '-' in user_choice:
            start_date_str, end_date_str = user_choice.split('-')
            start_date = parse_date_with_optional_year(
                start_date_str, current_year)
            end_date = parse_date_with_optional_year(
                end_date_str, current_year)

            current_date = start_date
            schedule_text = ""

            while current_date <= end_date:
                date_str = current_date.strftime('%d.%m.%y')
                if date_str in schedule:
                    schedule_text += f'Расписание на {
                        date_str}:\n{schedule[date_str]}\n\n'
                else:
                    schedule_text += f'Расписание на {
                        date_str} отсутствует.\n\n'
                current_date += timedelta(days=1)

            if schedule_text:
                await update.message.reply_text(schedule_text)
            else:
                await update.message.reply_text(f"Расписание на {date_str} отсутствует.")
        else:
            date = parse_date_with_optional_year(user_choice, current_year)
            date_str = date.strftime('%d.%m.%y')
            if date_str in schedule:
                await update.message.reply_text(f'Расписание на {date_str}:\n{schedule[date_str]}')
            else:
                await update.message.reply_text(f'Расписание на {date_str} отсутствует.')
    except ValueError:
        if user_choice in button_texts:
            await update.message.reply_text(button_texts[user_choice])


def parse_date_with_optional_year(date_str, current_year):
    try:
        return datetime.strptime(date_str, '%d.%m.%y')
    except ValueError:
        return datetime.strptime(f"{date_str}.{current_year}", '%d.%m.%Y')


async def notify_users(update_message: str, context: CallbackContext):
    users = get_users_from_db()
    for user in users:
        try:
            user_id = user["user_id"]
            await context.bot.send_message(chat_id=user_id, text=update_message)
        except Exception as e:
            print(f"Ошибка, чет пошло не так при рассылке {
                  user_id}: {e}")


async def update_bot_message(update: Update, context: CallbackContext) -> None:
    update_message = "Бот был обновлен! Обновлена кнопка (Сессия), добавлен список групп (Группы)"
    await notify_users(update_message, context)


async def show_users(update: Update, context: CallbackContext) -> None:
    users = get_users_from_db()
    if not users:
        await context.bot.send_message(chat_id=update.effective_chat.id, text="Нет пользователей в базе данных.")
        return

    message = "Список пользователей:\n"
    for user in users:
        user_id, username, last_active = user["user_id"], user["username"], user["last_active"]
        message += f"ID: {user_id}, \nUsername: {username}\n\n"

    await context.bot.send_message(chat_id=update.effective_chat.id, text=message)


def main():
    application = Application.builder().token(TOKEN).build()

    application.add_handler(CommandHandler('start', start))
    application.add_handler(MessageHandler(
        filters.TEXT & ~filters.COMMAND, button_handler))
    application.add_handler(CommandHandler('avadakedabra', update_bot_message))
    application.add_handler(CommandHandler('lumos', show_users))

    application.run_polling()


if __name__ == '__main__':
    print("Бот пошел")
    main()
